package ru.progwards.java1.lessons.files;

import java.util.List;

public class FilesSelect {

    public void selectFiles(String inFolder, String outFolder, List<String> keys) {

    }
/*
 сортирует файлы по их содержимому. Нужно просмотреть содержимое всех файлов, с расширением txt,
 содержащихся в каталоге inFolder с подкаталогами, и если файл содержит ключевое слово из коллекции keys,
 то скопировать его в подпапку с соответствующим именем, этого элемента keys, все подпапки должны находиться в outFolder.
 Например, вызвана функция с параметрами (“aaa”, “bbb”, {“check”, “files”} )
 нужно проверить каталог aaa с подкаталогами, найти там все файлы txt, и если файл содержит “check”,
 скопировать его в папку bbb/check, если файл содержит “files”, скопировать его в папку bbb/files.
 Важно! Если, например, слово “files” ни разу не встретилось, пустую папку создавать не нужно
*/
}
